zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/sams70q-pinctrl.h
/* pa31_gpio */
#define PA31_GPIO \
	SAM_PINMUX(a, 31, gpio, gpio)

/* pa31a_spi0_npcs1 */
#define PA31A_SPI0_NPCS1 \
	SAM_PINMUX(a, 31, a, periph)

/* pa31b_pmc_pck2 */
#define PA31B_PMC_PCK2 \
	SAM_PINMUX(a, 31, b, periph)

/* pa31c_hsmci_mcda1 */
#define PA31C_HSMCI_MCDA1 \
	SAM_PINMUX(a, 31, c, periph)

/* pa31d_pwmc1_pwmh2 */
#define PA31D_PWMC1_PWMH2 \
	SAM_PINMUX(a, 31, d, periph)

/* pb0_gpio */
#define PB0_GPIO \
	SAM_PINMUX(b, 0, gpio, gpio)

/* pb0a_pwmc0_pwmh0 */
#define PB0A_PWMC0_PWMH0 \
	SAM_PINMUX(b, 0, a, periph)

/* pb0c_usart0_rxd */
#define PB0C_USART0_RXD \
	SAM_PINMUX(b, 0, c, periph)

/* pb0d_ssc_tf */
#define PB0D_SSC_TF \
	SAM_PINMUX(b, 0, d, periph)

/* pb0x_afe0_ad10 */
#define PB0X_AFE0_AD10 \
	SAM_PINMUX(b, 0, x, extra)

/* pb0x_rtc_out0 */
#define PB0X_RTC_OUT0 \
	SAM_PINMUX(b, 0, x, extra)

/* pb1_gpio */
#define PB1_GPIO \
	SAM_PINMUX(b, 1, gpio, gpio)

/* pb1a_pwmc0_pwmh1 */
#define PB1A_PWMC0_PWMH1 \
	SAM_PINMUX(b, 1, a, periph)

/* pb1c_usart0_txd */
#define PB1C_USART0_TXD \
	SAM_PINMUX(b, 1, c, periph)

/* pb1d_ssc_tk */
#define PB1D_SSC_TK \
	SAM_PINMUX(b, 1, d, periph)

/* pb1x_afe1_ad0 */
#define PB1X_AFE1_AD0 \
	SAM_PINMUX(b, 1, x, extra)

/* pb1x_rtc_out1 */
#define PB1X_RTC_OUT1 \
	SAM_PINMUX(b, 1, x, extra)

/* pb2_gpio */
#define PB2_GPIO \
	SAM_PINMUX(b, 2, gpio, gpio)

/* pb2c_usart0_cts */
#define PB2C_USART0_CTS \
	SAM_PINMUX(b, 2, c, periph)

/* pb2d_spi0_npcs0 */
#define PB2D_SPI0_NPCS0 \
	SAM_PINMUX(b, 2, d, periph)

/* pb2x_afe0_ad5 */
#define PB2X_AFE0_AD5 \
	SAM_PINMUX(b, 2, x, extra)

/* pb3_gpio */
#define PB3_GPIO \
	SAM_PINMUX(b, 3, gpio, gpio)

/* pb3b_pmc_pck2 */
#define PB3B_PMC_PCK2 \
	SAM_PINMUX(b, 3, b, periph)

/* pb3c_usart0_rts */
#define PB3C_USART0_RTS \
	SAM_PINMUX(b, 3, c, periph)

/* pb3d_isi_d2 */
#define PB3D_ISI_D2 \
	SAM_PINMUX(b, 3, d, periph)

/* pb3x_afe0_ad2 */
#define PB3X_AFE0_AD2 \
	SAM_PINMUX(b, 3, x, extra)

/* pb3x_supc_wkup12 */
#define PB3X_SUPC_WKUP12 \
	SAM_PINMUX(b, 3, wkup12, wakeup)

/* pb4_gpio */
#define PB4_GPIO \
	SAM_PINMUX(b, 4, gpio, gpio)

/* pb4a_twi1_twd */
#define PB4A_TWI1_TWD \
	SAM_PINMUX(b, 4, a, periph)

/* pb4b_pwmc0_pwmh2 */
#define PB4B_PWMC0_PWMH2 \
	SAM_PINMUX(b, 4, b, periph)

/* pb4d_usart1_txd */
#define PB4D_USART1_TXD \
	SAM_PINMUX(b, 4, d, periph)

/* pb4s_jtag_tdi */
#define PB4S_JTAG_TDI \
	SAM_PINMUX(b, 4, s, system)

/* pb5_gpio */
#define PB5_GPIO \
	SAM_PINMUX(b, 5, gpio, gpio)

/* pb5a_twi1_twck */
#define PB5A_TWI1_TWCK \
	SAM_PINMUX(b, 5, a, periph)

/* pb5b_pwmc0_pwml0 */
#define PB5B_PWMC0_PWML0 \
	SAM_PINMUX(b, 5, b, periph)

/* pb5d_ssc_td */
#define PB5D_SSC_TD \
	SAM_PINMUX(b, 5, d, periph)

/* pb5s_jtag_tdo */
#define PB5S_JTAG_TDO \
	SAM_PINMUX(b, 5, s, system)

/* pb5s_swd_traceswo */
#define PB5S_SWD_TRACESWO \
	SAM_PINMUX(b, 5, s, system)

/* pb5x_supc_wkup13 */
#define PB5X_SUPC_WKUP13 \
	SAM_PINMUX(b, 5, wkup13, wakeup)

/* pb6_gpio */
#define PB6_GPIO \
	SAM_PINMUX(b, 6, gpio, gpio)

/* pb6s_jtag_tms */
#define PB6S_JTAG_TMS \
	SAM_PINMUX(b, 6, s, system)

/* pb6s_swd_swdio */
#define PB6S_SWD_SWDIO \
	SAM_PINMUX(b, 6, s, system)

/* pb7_gpio */
#define PB7_GPIO \
	SAM_PINMUX(b, 7, gpio, gpio)

/* pb7s_jtag_tck */
#define PB7S_JTAG_TCK \
	SAM_PINMUX(b, 7, s, system)

/* pb7s_swd_swclk */
#define PB7S_SWD_SWCLK \
	SAM_PINMUX(b, 7, s, system)

/* pb8_gpio */
#define PB8_GPIO \
	SAM_PINMUX(b, 8, gpio, gpio)

/* pb8s_supc_xout */
#define PB8S_SUPC_XOUT \
	SAM_PINMUX(b, 8, s, system)

/* pb9_gpio */
#define PB9_GPIO \
	SAM_PINMUX(b, 9, gpio, gpio)

/* pb9s_supc_xin */
#define PB9S_SUPC_XIN \
	SAM_PINMUX(b, 9, s, system)

/* pb12_gpio */
#define PB12_GPIO \
	SAM_PINMUX(b, 12, gpio, gpio)

/* pb12a_pwmc0_pwml1 */
#define PB12A_PWMC0_PWML1 \
	SAM_PINMUX(b, 12, a, periph)

/* pb12d_pcm_pck0 */
#define PB12D_PCM_PCK0 \
	SAM_PINMUX(b, 12, d, periph)

/* pb12s_flash_erase */
#define PB12S_FLASH_ERASE \
	SAM_PINMUX(b, 12, s, system)

/* pb13_gpio */
#define PB13_GPIO \
	SAM_PINMUX(b, 13, gpio, gpio)

/* pb13a_pwmc0_pwml2 */
#define PB13A_PWMC0_PWML2 \
	SAM_PINMUX(b, 13, a, periph)

/* pb13b_pcm_pck0 */
#define PB13B_PCM_PCK0 \
	SAM_PINMUX(b, 13, b, periph)

/* pb13c_usart0_sck */
#define PB13C_USART0_SCK \
	SAM_PINMUX(b, 13, c, periph)

/* pb13x_dacc_dac0 */
#define PB13X_DACC_DAC0 \
	SAM_PINMUX(b, 13, x, extra)

/* pc0_gpio */
#define PC0_GPIO \
	SAM_PINMUX(c, 0, gpio, gpio)

/* pc0a_ebi_d0 */
#define PC0A_EBI_D0 \
	SAM_PINMUX(c, 0, a, periph)

/* pc0b_pwmc0_pwml0 */
#define PC0B_PWMC0_PWML0 \
	SAM_PINMUX(c, 0, b, periph)

/* pc0x_afe1_ad9 */
#define PC0X_AFE1_AD9 \
	SAM_PINMUX(c, 0, x, extra)

/* pc1_gpio */
#define PC1_GPIO \
	SAM_PINMUX(c, 1, gpio, gpio)

/* pc1a_ebi_d1 */
#define PC1A_EBI_D1 \
	SAM_PINMUX(c, 1, a, periph)

/* pc1b_pwmc0_pwml1 */
#define PC1B_PWMC0_PWML1 \
	SAM_PINMUX(c, 1, b, periph)

/* pc2_gpio */
#define PC2_GPIO \
	SAM_PINMUX(c, 2, gpio, gpio)

/* pc2a_ebi_d2 */
#define PC2A_EBI_D2 \
	SAM_PINMUX(c, 2, a, periph)

/* pc2b_pwmc0_pwml2 */
#define PC2B_PWMC0_PWML2 \
	SAM_PINMUX(c, 2, b, periph)

/* pc3_gpio */
#define PC3_GPIO \
	SAM_PINMUX(c, 3, gpio, gpio)

/* pc3a_ebi_d3 */
#define PC3A_EBI_D3 \
	SAM_PINMUX(c, 3, a, periph)

/* pc3b_pwmc0_pwml3 */
#define PC3B_PWMC0_PWML3 \
	SAM_PINMUX(c, 3, b, periph)

/* pc4_gpio */
#define PC4_GPIO \
	SAM_PINMUX(c, 4, gpio, gpio)

/* pc4a_ebi_d4 */
#define PC4A_EBI_D4 \
	SAM_PINMUX(c, 4, a, periph)

/* pc5_gpio */
#define PC5_GPIO \
	SAM_PINMUX(c, 5, gpio, gpio)

/* pc5a_ebi_d5 */
#define PC5A_EBI_D5 \
	SAM_PINMUX(c, 5, a, periph)

/* pc5b_tc2_tioa6 */
#define PC5B_TC2_TIOA6 \
	SAM_PINMUX(c, 5, b, periph)

/* pc6_gpio */
#define PC6_GPIO \
	SAM_PINMUX(c, 6, gpio, gpio)

/* pc6a_ebi_d6 */
#define PC6A_EBI_D6 \
	SAM_PINMUX(c, 6, a, periph)

/* pc6b_tc2_tiob6 */
#define PC6B_TC2_TIOB6 \
	SAM_PINMUX(c, 6, b, periph)

/* pc7_gpio */
#define PC7_GPIO \
	SAM_PINMUX(c, 7, gpio, gpio)

/* pc7a_ebi_d7 */
#define PC7A_EBI_D7 \
	SAM_PINMUX(c, 7, a, periph)

/* pc7b_tc2_tclk6 */
#define PC7B_TC2_TCLK6 \
	SAM_PINMUX(c, 7, b, periph)

